app/Controllers/AdminController.php

    public function index()
    {
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'You do not have permission to access this page.');
        }

        // Get database connection
        $db = \Config\Database::connect();

        // Get total users count
        $totalUsers = $db->table('users')->countAllResults();

        // Get active teachers count (users with role 'teacher')
        $activeTeachers = $db->table('users')
            ->where('role', 'teacher')
            ->countAllResults();

        // Get active students count (users with role 'student')
        $activeStudents = $db->table('users')
            ->where('role', 'student')
            ->countAllResults();

        // Get total courses count (if courses table exists)
        $totalCourses = 0;
        if ($db->tableExists('courses')) {
            $totalCourses = $db->table('courses')->countAllResults();
        }

        // Get recent activity (recent user registrations)
        $recentActivity = $db->table('users')
            ->select('name, email, role, created_at')
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT `name`, `email`, `role`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5