app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'jjamero@gmail.com'
---
                $password = $this->request->getPost('password');

                $builder = $db->table('users');
                $user = $builder->where('email', $email)->get()->getRow();