app/Controllers/StudentController.php

SELECT *
FROM `courses`
---
    public function dashboard()
    {
        // Check if user is logged in and has student role
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'student') {
            session()->setFlashdata('error', 'You do not have permission to access this page.');
            return redirect()->to('/login');
        }

        $enrollmentModel = new EnrollmentModel();
        $courseModel = new CourseModel();
        $user_id = session()->get('userID');

        $enrolled_courses = $enrollmentModel->getUserEnrollments($user_id);
        $all_courses = $courseModel->findAll();

SELECT `courses`.`id` as `id`, `courses`.`title`, `courses`.`description`, `courses`.`instructor_id`, `users`.`name` as `instructor_name`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
WHERE `enrollments`.`user_id` = '3'
AND `enrollments`.`status` = 'enrolled'
---
    public function courses()
    {
        // Check if user is logged in and has student role
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'student') {
            session()->setFlashdata('error', 'You do not have permission to access this page.');
            return redirect()->to('/login');
        }

        $enrollmentModel = new EnrollmentModel();
        $courseModel = new CourseModel();
        $user_id = session()->get('userID');

        // Get courses the student is enrolled in, including course description and instructor name
        // We'll join courses -> enrollments -> users (instructor)
        $builder = $enrollmentModel->select('courses.id as id, courses.title, courses.description, courses.instructor_id, users.name as instructor_name')
                               ->join('courses', 'courses.id = enrollments.course_id')
                               ->join('users', 'users.id = courses.instructor_id', 'left')
                               ->where('enrollments.user_id', $user_id)
                               ->where('enrollments.status', 'enrolled');

        $enrolled_with_instructor = $builder->findAll();

SELECT *
FROM `courses`
---
            unset($course); // Unset reference
        }
        // Also compute available courses (courses the student is not enrolled in)
        $all_courses = $courseModel->findAll();