app/Controllers/TeacherController.php

    public function dashboard()
    {
        // Check if user is logged in and has teacher role
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'teacher') {
            session()->setFlashdata('error', 'You do not have permission to access this page.');
            return redirect()->to('/login');
        }

        $teacherId = session()->get('userID');

        // Get teacher's courses
        $courses = $this->courseModel->where('instructor_id', $teacherId)->findAll();
---
SELECT *
FROM `courses`
WHERE `instructor_id` = '2'

    public function courseDetails($id = null)
    {
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'teacher') {
            return redirect()->to('/login')->with('error', 'You do not have permission to access this page.');
        }

        $teacherId = session()->get('userID');

        // Ensure the course belongs to this teacher
        $course = $this->courseModel->where('id', $id)->where('instructor_id', $teacherId)->first();
        if (!$course) {
            return redirect()->to('/teacher/dashboard')->with('error', 'Course not found or access denied.');
        }

        // Get enrolled students for this course (join users)
        $enrollmentModel = $this->enrollmentModel;
        $students = $enrollmentModel->select('users.id, users.name, users.email, enrollments.enrollment_date')
                                    ->join('users', 'users.id = enrollments.user_id')
                                    ->where('enrollments.course_id', $id)
                                    ->where('enrollments.status', 'enrolled')
                                    ->orderBy('enrollments.enrollment_date', 'DESC')
                                    ->findAll();
---
SELECT *
FROM `courses`
WHERE `id` = '1'
AND `instructor_id` = '2'
 LIMIT 1
SELECT `users`.`id`, `users`.`name`, `users`.`email`, `enrollments`.`enrollment_date`
FROM `enrollments`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `enrollments`.`course_id` = '1'
AND `enrollments`.`status` = 'enrolled'
ORDER BY `enrollments`.`enrollment_date` DESC