app/Models/EnrollmentModel.php

SELECT `courses`.*
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '3'
---
    public function getUserEnrollments($user_id)
    {
        return $this->select('courses.*')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $user_id)
                    ->findAll();

SELECT `course_id`, COUNT(*) AS students
FROM `enrollments`
WHERE `status` = 'enrolled'
AND `course_id` IN ('1')
GROUP BY `course_id`
---
    public function countStudentsByCourseIds(array $courseIds = [])
    {
        $builder = $this->select('course_id, COUNT(*) AS students')
                        ->where('status', 'enrolled')
                        ->groupBy('course_id');

        if (!empty($courseIds)) {
            $builder->whereIn('course_id', $courseIds);
        }

        $rows = $builder->findAll();